{
  "saju_description": {
    "title": "임술일주 (壬戌日柱)",
    "main_element": {
      "day_master": "임수(壬水)",
      "description": "강물이나 바다에 비유되는 지혜롭고 포용력 있는 기운. 유연하면서도 본인의 흐름을 유지하는 강단이 있음."
    },
    "structure": "넓은 대지 아래로 흐르는 강물",
    "summary": "엄격한 자기 절제와 위기 돌파력을 지닌 본질",
    "overall": "임술일주는 큰 강물이 넓은 들판 아래로 흐르는 형상입니다. 물은 본래 유연하지만, 술토(戌土)라는 단단한 땅을 만나면서 강인한 의지와 책임감을 갖추게 됩니다. 겉으로는 차분하고 포용력이 있어 보이지만, 내면에는 위기를 돌파하는 강력한 에너지가 숨어 있습니다. 조직이나 사회에서 중요한 역할을 맡으며, 어려운 상황에서도 흔들리지 않고 목표를 향해 나아가는 사람입니다."
  },
  "four_pillars": {
    "hour": {
      "title": "시주 (경술)",
      "subtitle": "결과와 말년, 전문성",
      "heavenly_stem": {
        "code": "경(庚)",
        "stars": [
          {
            "name": "천을귀인",
            "description": "하늘의 덕을 입는 최고의 길성으로, 일생에 걸쳐 큰 재난이나 위기에서 나를 구해주는 힘이 있습니다. 곤경에 처했을 때 예상치 못한 도움이 나타나거나, 불가능해 보이던 일이 해결되는 경험을 하게 됩니다."
          },
          {
            "name": "월덕귀인",
            "description": "달의 은총을 입어 일생에 재액이 적고 관운이 따릅니다. 주변 사람들의 신뢰를 받기 쉽고, 일의 마무리가 깔끔하게 정리되는 작용을 합니다. 특히 말년에 평안함과 안정을 가져다줍니다."
          },
          {
            "name": "현침살",
            "description": "바늘처럼 날카로운 분석력과 문필력을 상징합니다. 정신이 예리하고 비판적이며, 정밀한 기술이나 분석 능력이 탁월합니다. 글을 쓰거나 말로 표현하는 능력이 뛰어나며, 본질을 꿰뚫어보는 통찰력이 있습니다."
          },
          {
            "name": "백호대살",
            "description": "경술 괴강과 맞물려 강력한 추진력과 폭발적 기운을 형성합니다. 흰 호랑이의 강한 에너지로, 전문 분야에서 독보적인 성취를 이루는 힘을 가집니다. 결단력이 강하고 목표를 향한 집중력이 뛰어나지만, 과격하거나 독단적이 될 수 있으니 주의가 필요합니다."
          }
        ]
      },
      "earthly_branch": {
        "code": "술(戌)",
        "stars": [
          {
            "name": "화개살",
            "description": "예술적 감수성과 종교적·철학적 깊이를 더합니다. 화려함을 덮는 덮개라는 의미로, 사색을 즐기고 정신세계에 관심이 많습니다. 예술, 학문, 종교 분야에서 깊이 있는 성취를 이루며, 고독 속에서도 자신만의 세계를 구축하는 능력이 있습니다."
          },
          {
            "name": "백호대살",
            "description": "일지의 술토와 함께 강력한 권력 의지를 나타냅니다. 시주에서 백호대살이 중첩되어 나타나면, 말년까지 강한 추진력과 영향력을 유지합니다. 노년에도 왕성한 활동력을 보이며, 후학을 양성하거나 전문 분야에서 권위자로 인정받을 가능성이 높습니다."
          }
        ]
      }
    },
    "day": {
      "title": "일주 (임술)",
      "subtitle": "본인과 내면의 공간",
      "heavenly_stem": {
        "code": "임(壬)",
        "stars": [
          {
            "name": "본원",
            "description": "본인 자체의 기운에 집중하며 모든 만물을 포용합니다. 일간(日干)은 나 자신을 상징하며, 임수는 큰 강이나 바다처럼 넓고 깊은 포용력을 가집니다. 지혜롭고 융통성이 있으며, 다양한 상황에 적응하는 능력이 뛰어납니다."
          }
        ]
      },
      "earthly_branch": {
        "code": "술(戌)",
        "stars": [
          {
            "name": "황은대사",
            "description": "황제의 은혜로 어려움 속에서도 사면을 받는 천운입니다. '황제의 은혜로 사면받는다'는 뜻으로, 곤경에 처했을 때 뜻밖의 귀인이 나타나 구제해주거나, 윗사람의 각별한 도움을 받는 복록입니다. 위기의 순간에 기적적으로 해결책이 나타나는 경험을 하게 됩니다."
          },
          {
            "name": "문곡귀인",
            "description": "학문과 예술 분야에서 두각을 나타내는 총명함의 별입니다. 지적 호기심이 강하고 문장력이 좋으며, 지식 습득 능력이 뛰어납니다. 글을 쓰거나 가르치는 일, 연구 분야에서 탁월한 재능을 발휘합니다."
          },
          {
            "name": "태극귀인",
            "description": "시종일관 나를 돕는 큰 복으로 중년 이후 안정을 꾀합니다. 인생 전반에 걸쳐 사고를 당해도 크게 다치지 않게 보호해주며, 노년까지 안락을 보장하는 길성입니다. 정신적으로나 물질적으로 평안한 삶을 누릴 수 있는 복을 가집니다."
          }
        ]
      }
    },
    "month": {
      "title": "월주 (임진)",
      "subtitle": "사회적 위치와 부모운",
      "heavenly_stem": {
        "code": "임(壬)",
        "stars": [
          {
            "name": "백호대살",
            "description": "사회적 환경(월주)에 백호가 자리 잡고 있습니다. 경쟁이 치열한 환경에서 살아남는 강한 생명력과 독립심을 의미합니다. 사회생활에서 강력한 추진력을 발휘하며, 리더십과 결단력으로 조직을 이끌어가는 역할을 맡게 됩니다."
          }
        ]
      },
      "earthly_branch": {
        "code": "진(辰)",
        "stars": [
          {
            "name": "괴강살",
            "description": "월지에 괴강이 있어 사회적으로 강력한 영향력을 발휘합니다. 절체절명의 순간에 폭발적인 힘을 발휘하는 에너지로, 위기 상황에서 엄청난 추진력과 집중력을 보입니다. 평범해 보이다가도 중요한 순간에 판을 뒤집는 능력이 있습니다."
          },
          {
            "name": "반안살",
            "description": "직위 상승과 실속 있는 성공을 가져다줍니다. 사회적으로 대접받는 위치에 오르며, 체면과 명예를 중시합니다. 조직 내에서 인정받고 승진하는 운이 있으며, 실속을 챙기는 능력도 뛰어납니다."
          },
          {
            "name": "화개살",
            "description": "월지에도 화개가 있어 학문이나 예술적 소양을 사회적 기반으로 삼으려는 기운이 강합니다. 전문적인 지식이나 기술을 바탕으로 사회적 위치를 확립하며, 독특한 관점과 깊이 있는 통찰력으로 주목받습니다."
          }
        ]
      }
    },
    "year": {
      "title": "년주 (신미)",
      "subtitle": "조상과 유년기 환경",
      "heavenly_stem": {
        "code": "신(辛)",
        "stars": [
          {
            "name": "정인",
            "description": "정통적인 교육과 안정적인 학습 환경을 의미합니다. 어린 시절 바른 가르침을 받았으며, 조상이나 부모로부터 지혜와 덕을 물려받았습니다. 차분하고 안정적인 성장 배경을 가집니다."
          }
        ]
      },
      "earthly_branch": {
        "code": "미(未)",
        "stars": [
          {
            "name": "정관",
            "description": "유년기부터 바른 질서와 규칙을 중시하는 환경에서 자랐습니다. 책임감과 도덕성을 중요하게 여기는 가치관이 형성되었으며, 대외적으로 신뢰받는 배경을 가집니다."
          },
          {
            "name": "반안살",
            "description": "년지에 반안살이 있어 가문의 체면과 명예를 중시하는 환경에서 성장했습니다. 조상이나 집안의 사회적 위치가 있었거나, 대외적으로 인정받는 배경을 가질 가능성이 있습니다."
          }
        ]
      }
    }
  },
  "sal_summary": {
    "top_sal": [
      {
        "rank": 1,
        "name": "괴강살 & 백호대살",
        "count": "4회 출현",
        "locations": "일주 임술, 월주 임진, 시주 술",
        "icon": "⚡⚡⚡⚡",
        "meaning": "철혈의 리더, 혁명가적 기질, 불굴의 의지",
        "pros": "조직 장악력, 판을 뒤엎는 에너지, 기적적인 돌파력",
        "cons": "독선적 성향, 극단적인 삶의 굴곡",
        "detail": "전 사주에 걸쳐 깔려 있어 압도적인 추진력과 결단력을 발휘합니다. 위기의 순간에 폭발적인 에너지를 발휘하며, 불가능해 보이는 상황도 돌파해내는 능력이 있습니다."
      },
      {
        "rank": 2,
        "name": "화개살",
        "count": "3회 출현",
        "locations": "시주 술, 일주 술, 월주 진",
        "icon": "🎨🎨🎨",
        "meaning": "고독한 전략가, 지략가, 전문가 기질",
        "pros": "사색적 깊이, 특정 분야의 독보적 경지",
        "cons": "고립성, 내면의 쓸쓸함",
        "detail": "결과(시주) + 나(일주) + 사회(월주) 전부에 화개가 있어, 혼자 깊이 파고드는 전문가 기질이 강합니다. 예술, 학문, 철학 분야에서 독보적인 성취를 이룰 가능성이 높습니다."
      },
      {
        "rank": 3,
        "name": "천을귀인 & 월덕귀인",
        "count": "2회 출현",
        "locations": "시주 경",
        "icon": "✨✨",
        "meaning": "하늘과 달의 보호, 천운",
        "pros": "위기에서 구원, 귀인의 도움, 재난 면제",
        "cons": "없음 (순수 길성)",
        "detail": "시주에 천을귀인과 월덕귀인이 함께 있어, 말년까지 하늘의 보호를 받습니다. 어려운 상황에서도 반드시 도움의 손길이 나타나며, 큰 사고나 재난에서 보호받는 운명입니다."
      },
      {
        "rank": 4,
        "name": "반안살",
        "count": "2회 출현",
        "locations": "월주 진, 년주 미",
        "icon": "👑👑",
        "meaning": "직위 상승, 실속 있는 성공, 체면",
        "pros": "사회적 대접을 받는 위치, 실속 챙기는 능력",
        "cons": "자존심 상처 시의 큰 분노",
        "detail": "조상(년주)과 사회(월주)에 반안살이 있어, 명예와 체면을 중시하는 환경에서 성장했으며, 사회적으로도 인정받는 위치에 오릅니다."
      }
    ],
    "key_point": "🔑 한 줄 정리",
    "one_line_summary": "치열한 삶의 현장에서 천운(귀인4)의 도움을 받으며 스스로 왕좌를 차지하는 '천우신조의 승부사' 사주. 압도적 카리스마(괴강/백호4) + 날카로운 심리안(천문2) + 전략적 전문성(화개3) = 거친 야생에서 판을 흔들고 결국 승리하는 구조."
  }
}
